Revit 2026 API

# DockablePaneProviderData Methods

---

The DockablePaneProviderData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetFrameworkElement | Wrapper function that returns the FrameworkElement for this provider. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

DockablePaneProviderData Class

Autodesk.Revit.UI Namespace